In [2]:
# To get the outpout in single window ?
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Linear Algebra and multidimentional arrays
import pandas as pd

# Data analysis and manipulation tool
import numpy as np

# Random number generator
import random 

# Specialized container data types, Counter is dictionary sub-class for counting hashtable objects
from collections import Counter

# Visualization libraries
import matplotlib.pyplot as plt

import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

# setting option to set data rows as max 500
pd.set_option('display.max_rows', 500)

In [3]:
# Getting pandas dataframe
td = pd.read_csv('https://raw.githubusercontent.com/dphi-official/Datasets/master/titanic_data.csv')

# get data volume
td.shape

(891, 12)

In [4]:
# same for training
tt = pd.read_csv('https://raw.githubusercontent.com/dphi-official/Datasets/master/titanic_test.csv')

tt.shape

(418, 11)

In [5]:
tt.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
td.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
td.head(7)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S

[7 rows x 12 columns]

In [8]:
tt.head(7)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S
5          897       3  ...   NaN        S
6          898       3  ...   NaN        Q

[7 rows x 11 columns]

In [9]:
# Getting the first row
td.iloc[[5]]

   PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
5            6         0       3  ...  8.4583   NaN         Q

[1 rows x 12 columns]

In [10]:
tt.iloc[[5]]

   PassengerId  Pclass                        Name  ...   Fare  Cabin  Embarked
5          897       3  Svensson, Mr. Johan Cervin  ...  9.225    NaN         S

[1 rows x 11 columns]

In [16]:
dataColumns1 = td.isnull().sum()

dataColumns1

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
tt.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
dataColumns1[dataColumns1 > 0]

Age         177
Cabin       687
Embarked      2
dtype: int64

In [21]:
td.shape[0]

891

In [18]:
dataColumns1[dataColumns1 > 0] * 100 / td.shape[0]

Age         19.865320
Cabin       77.104377
Embarked     0.224467
dtype: float64